app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math"], ["room_number", 303], ["created_at", "2021-04-17 05:09:46.315751"], ["updated_at", "2021-04-17 05:09:46.315751"]]
---
    def create
        @school_class = SchoolClass.new(post_params(:title, :room_number))
        @school_class.save