app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ethan"], ["last_name", "lehman"], ["created_at", "2021-04-17 05:01:36.308134"], ["updated_at", "2021-04-17 05:01:36.308134"]]
---
    def create
        @student = Student.create(post_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ethan C."], ["updated_at", "2021-04-17 05:02:02.881854"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name, :last_name))